Connect postgrees

#!pip install ipython-sql
#!pip install py-postgresql
#!pip install psycopg2-binary
#!pip install sqlalchemy
#!pip3 install sqlalchemy
#!pip3 install flask-sqlalchemy --user

In [7]:
""" import psycopg2 
import pandas as ps
from sqlalchemy import create_engine
from sqlalchemy import URL

url_object = URL.create(
    
    "postgresql+psycopg2",
    username="postgres",
    password="openpgpwd",  # plain (unescaped) text
    host="localhost",
   # database="test",
    database="RetailDB",
)
#alchemyEngine = create_engine(postgresql+psycopg2://openpg:P@ssw0rd@localhost:5432/RetailDB);

alchemyEngine = create_engine(url_object);
# Connect to PostgreSQL server
#print(alchemyEngine)
dbConnection = alchemyEngine.connect();
#print(dbConnection) """

' import psycopg2 \nimport pandas as ps\nfrom sqlalchemy import create_engine\nfrom sqlalchemy import URL\n\nurl_object = URL.create(\n    \n    "postgresql+psycopg2",\n    username="postgres",\n    password="openpgpwd",  # plain (unescaped) text\n    host="localhost",\n   # database="test",\n    database="RetailDB",\n)\n#alchemyEngine = create_engine(postgresql+psycopg2://openpg:P@ssw0rd@localhost:5432/RetailDB);\n\nalchemyEngine = create_engine(url_object);\n# Connect to PostgreSQL server\n#print(alchemyEngine)\ndbConnection = alchemyEngine.connect();\n#print(dbConnection) '

In [8]:
""" # Read data from PostgreSQL database table and load into a DataFrame instance

df   = ps.read_sql("SELECT * FROM sale_order_line LIMIT 100", dbConnection)
ps.set_option('display.expand_frame_repr', False)

 """

' # Read data from PostgreSQL database table and load into a DataFrame instance\n\ndf   = ps.read_sql("SELECT * FROM sale_order_line LIMIT 100", dbConnection)\nps.set_option(\'display.expand_frame_repr\', False)\n\n '

In [9]:
""" from sqlalchemy import text
con=alchemyEngine.connect()
query = "SELECT * FROM sale_order_line LIMIT 100;"
result =con.execute(text(query))
df= ps.DataFrame(list(result))
df.head(5) """

' from sqlalchemy import text\ncon=alchemyEngine.connect()\nquery = "SELECT * FROM sale_order_line LIMIT 100;"\nresult =con.execute(text(query))\ndf= ps.DataFrame(list(result))\ndf.head(5) '

In [1]:
import pandas as pd

In [2]:
help(pd.read_sql)

Help on function read_sql in module pandas.io.sql:

read_sql(sql, con, index_col: 'str | list[str] | None' = None, coerce_float: 'bool' = True, params=None, parse_dates=None, columns: 'list[str] | None' = None, chunksize: 'int | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>, dtype: 'DtypeArg | None' = None) -> 'DataFrame | Iterator[DataFrame]'
    Read SQL query or database table into a DataFrame.

    This function is a convenience wrapper around ``read_sql_table`` and
    ``read_sql_query`` (for backward compatibility). It will delegate
    to the specific function depending on the provided input. A SQL query
    will be routed to ``read_sql_query``, while a database table name will
    be routed to ``read_sql_table``. Note that the delegated function might
    have more specific notes about their functionality not listed here.

    Parameters
    ----------
    sql : str or SQLAlchemy Selectable (select or text object)
        SQL query to be executed or a table name.
    con : SQLAlchemy connectable, str, or sqlite3 connection
        Using SQLAlchemy makes it possible to use any DB supported by that
        library. If a DBAPI2 object, only sqlite3 is supported. The user is responsible
        for engine disposal and connection closure for the SQLAlchemy connectable; str
        connections are closed automatically. See
        `here <https://docs.sqlalchemy.org/en/13/core/connections.html>`_.
    index_col : str or list of str, optional, default: None
        Column(s) to set as index(MultiIndex).
    coerce_float : bool, default True
        Attempts to convert values of non-string, non-numeric objects (like
        decimal.Decimal) to floating point, useful for SQL result sets.
    params : list, tuple or dict, optional, default: None
        List of parameters to pass to execute method.  The syntax used
        to pass parameters is database driver dependent. Check your
        database driver documentation for which of the five syntax styles,
        described in PEP 249's paramstyle, is supported.
        Eg. for psycopg2, uses %(name)s so use params={'name' : 'value'}.
    parse_dates : list or dict, default: None
        - List of column names to parse as dates.
        - Dict of ``{column_name: format string}`` where format string is
          strftime compatible in case of parsing string times, or is one of
          (D, s, ns, ms, us) in case of parsing integer timestamps.
        - Dict of ``{column_name: arg dict}``, where the arg dict corresponds
          to the keyword arguments of :func:`pandas.to_datetime`
          Especially useful with databases without native Datetime support,
          such as SQLite.
    columns : list, default: None
        List of column names to select from SQL table (only used when reading
        a table).
    chunksize : int, default None
        If specified, return an iterator where `chunksize` is the
        number of rows to include in each chunk.
    dtype_backend : {"numpy_nullable", "pyarrow"}, defaults to NumPy backed DataFrames
        Which dtype_backend to use, e.g. whether a DataFrame should have NumPy
        arrays, nullable dtypes are used for all dtypes that have a nullable
        implementation when "numpy_nullable" is set, pyarrow is used for all
        dtypes if "pyarrow" is set.

        The dtype_backends are still experimential.

        .. versionadded:: 2.0
    dtype : Type name or dict of columns
        Data type for data or columns. E.g. np.float64 or
        {‘a’: np.float64, ‘b’: np.int32, ‘c’: ‘Int64’}.
        The argument is ignored if a table is passed instead of a query.

        .. versionadded:: 2.0.0

    Returns
    -------
    DataFrame or Iterator[DataFrame]

    See Also
    --------
    read_sql_table : Read SQL database table into a DataFrame.
    read_sql_query : Read SQL query into a DataFrame.

    Examples
    --------
    Read data from SQL via either a SQL query or a SQL tablename.
    When using a SQLite database only SQL queries are accepted,
    providing only the SQL tablename will result in an error.

    >>> from sqlite3 import connect
    >>> conn = connect(':memory:')
    >>> df = pd.DataFrame(data=[[0, '10/11/12'], [1, '12/11/10']],
    ...                   columns=['int_column', 'date_column'])
    >>> df.to_sql('test_data', conn)
    2

    >>> pd.read_sql('SELECT int_column, date_column FROM test_data', conn)
       int_column date_column
    0           0    10/11/12
    1           1    12/11/10

    >>> pd.read_sql('test_data', 'postgres:///db_name')  # doctest:+SKIP

    Apply date parsing to columns through the ``parse_dates`` argument
    The ``parse_dates`` argument calls ``pd.to_datetime`` on the provided columns.
    Custom argument values for applying ``pd.to_datetime`` on a column are specified
    via a dictionary format:

    >>> pd.read_sql('SELECT int_column, date_column FROM test_data',
    ...             conn,
    ...             parse_dates={"date_column": {"format": "%d/%m/%y"}})
       int_column date_column
    0           0  2012-11-10
    1           1  2010-11-12

In [31]:
conn="postgresql://postgres:openpgpwd@localhost:5432/RetailDB"
query='''SELECT order_id ,sum(price_total) as price_total FROM sale_order_line

group by order_id
order by sum(price_total)  desc
 ;'''
df=pd.read_sql(query,conn)

In [30]:
df.columns

Index(['order_id', 'price_total'], dtype='object')

connector Mysql

In [13]:
""" import mysql.connector

cnx = mysql.connector.connect(user='root', password='openpgpwd',
                              host='127.0.0.1',
                              database='mydbtest')
cnx.close() """

" import mysql.connector\n\ncnx = mysql.connector.connect(user='root', password='openpgpwd',\n                              host='127.0.0.1',\n                              database='mydbtest')\ncnx.close() "

In [14]:
%load_ext sql

In [15]:
%env  DATABASE_URL = 'mysql://{user}:{password}@localhost/mydbtest'.format(user='root',password='openpgpwd')

env: DATABASE_URL='mysql://{user}:{password}@localhost/mydbtest'.format(user='root',password='openpgpwd')

In [16]:
connection_url = 'mysql://{user}:{password}@localhost/mydbtest'.format(user='root',password='openpgpwd')
%sql {connection_url}

In [17]:
%%sql
select * from mttable;

 * mysql://root:***@localhost/mydbtest
6 rows affected.

[('Muhammad', 2),
 ('Muhammad', 1),
 ('Muhammad', 1),
 ('Muhammad', 1),
 ('Muhammad', 1),
 ('Muhammad', 1)]

In [18]:
connMysql='mysql://{user}:{password}@localhost/mydbtest'.format(user='root',password='openpgpwd')
queryMysql='''select * from mttable'''

In [19]:
dfMysql=pd.read_sql(queryMysql,connMysql)
dfMysql

       name  id
0  Muhammad   2
1  Muhammad   1
2  Muhammad   1
3  Muhammad   1
4  Muhammad   1
5  Muhammad   1

In [32]:
#insert into from Potstgres to Myqsql
df.to_sql('sale_order_line',connMysql,if_exists='replace',index=False)
print('dd')

56

In [33]:
%%sql  
select * from sale_order_line

 * mysql://root:***@localhost/mydbtest
56 rows affected.

[(55, 74458.18),
 (54, 28088.23),
 (44, 17550.0),
 (46, 12250.0),
 (56, 9555.65),
 (45, 7752.0),
 (23, 4350.0),
 (41, 3645.0),
 (38, 3598.0),
 (2, 2947.5),
 (20, 2947.5),
 (4, 2240.0),
 (21, 2175.0),
 (47, 2075.0),
 (52, 2064.0),
 (24, 1990.0),
 (36, 1799.0),
 (32, 1799.0),
 (19, 1740.0),
 (1, 1740.0),
 (7, 1706.0),
 (30, 1599.0),
 (14, 1582.0),
 (15, 1541.5),
 (22, 1475.0),
 (31, 1349.0),
 (28, 1199.0),
 (16, 1186.5),
 (3, 1127.5),
 (11, 1096.5),
 (29, 1047.0),
 (17, 951.0),
 (26, 900.0),
 (48, 880.0),
 (18, 831.0),
 (10, 751.0),
 (6, 750.0),
 (27, 750.0),
 (9, 654.0),
 (53, 600.0),
 (25, 599.0),
 (12, 556.0),
 (8, 462.0),
 (33, 415.5),
 (13, 415.5),
 (5, 405.0),
 (39, 329.0),
 (50, 305.78),
 (40, 141.0),
 (49, 75.29),
 (34, 66.0),
 (51, 60.0),
 (35, 47.0),
 (37, 25.0),
 (42, 14.0),
 (43, 12.5)]